app/views/homes/charts.html.erb

    <h3>Visits By Country Per Day</h3>
    <%= line_chart   Visit.pluck("country").uniq.map { |c| { name: c, data: @visits.where(country: c).group_by_day(:visited_at, format: "%B %d, %Y").count }  }, discrete: true %>
---
SELECT COUNT(*) AS count_all, (DATE_TRUNC('day', ("visited_at"::timestamptz - INTERVAL '0 hour') AT TIME ZONE 'Etc/UTC') + INTERVAL '0 hour') AT TIME ZONE 'Etc/UTC' AS day FROM "visits" WHERE "visits"."country" = $1 AND ("visited_at" IS NOT NULL) GROUP BY (DATE_TRUNC('day', ("visited_at"::timestamptz - INTERVAL '0 hour') AT TIME ZONE 'Etc/UTC') + INTERVAL '0 hour') AT TIME ZONE 'Etc/UTC'  [["country", "United States"]]