app/controllers/homes_controller.rb

SELECT "visits".* FROM "visits"
---
  def show
  	@visits = Visit.all

SELECT "visits".* FROM "visits"
SELECT "books".* FROM "books"
SELECT  "books".* FROM "books" WHERE "books"."id" = $1 LIMIT 1  [["id", 1]]
---
  def charts
    @visits = Visit.all
    @books = Book.all
    @book_test = Book.find(1)